docs/plugins.dot
digraph {

  cross[label="sbt-crossproject"]
  fix[label="sbt-scalafix"]
  fmt[label="sbt-scalafmt"]
  git[label="sbt-git"]
  gpg[label="sbt-gpg"]
  header[label="sbt-header"]
  laika[label="laika-sbt"]
  mdoc[label="sbt-mdoc"]
  mima[label="sbt-mima-plugin"]
  sncp[label="sbt-scala-native-crossproject"]
  sjs[label="sbt-scalajs"]
  sjscp[label="sbt-scalajs-crossproject"]
  unidoc[label="sbt-unidoc"]

  node[color="#FF4C61"];

  tlkernel[label="sbt-typelevel-kernel"];

  tlnopub[label="sbt-typelevel-no-publish"];

  tlsettings[label="sbt-typelevel-settings"];
  tlsettings -> tlkernel;
  tlsettings -> git;
  tlsettings -> cross;

  tlgithub[label="sbt-typelevel-github"];
  tlgithub -> tlkernel;
  tlgithub -> git;
  tlgithub -> sjs;

  tlversioning[label="sbt-typelevel-versioning"];
  tlversioning -> tlkernel;
  tlversioning -> git;

  tlmima[label="sbt-typelevel-mima"];
  tlmima -> tlkernel;
  tlmima -> mima;

  tlsonatype[label="sbt-typelevel-sonatype"];
  tlsonatype -> tlkernel;
  tlsonatype -> mima;
  tlsonatype -> unidoc;

  tlgha[label="sbt-typelevel-github-actions"]

  tlcisigning[label="sbt-typelevel-ci-signing"];
  tlcisigning -> tlgha;
  tlcisigning -> gpg;

  tlsonatypecirelease[label="sbt-typelevel-sonatype-ci-release"];
  tlsonatypecirelease -> tlsonatype;
  tlsonatypecirelease -> tlgha;

  tlci[label="sbt-typelevel-ci"];
  tlci -> tlkernel;
  tlci -> tlnopub;
  tlci -> tlgha;

  tlfix[label="sbt-typelevel-scalafix"];
  tlfix -> fix;

  tlmergify[label="sbt-typelevel-mergify"];
  tlmergify -> tlgha;

  tlsite[label="sbt-typelevel-site"];
  tlsite -> tlkernel;
  tlsite -> tlgithub;
  tlsite -> tlgha;
  tlsite -> tlnopub;
  tlsite -> mdoc;
  tlsite -> laika;

  node[shape="box"];

  tlcirelease[label="sbt-typelevel-ci-release"];
  tlcirelease -> tlci;
  tlcirelease -> tlgithub;
  tlcirelease -> tlversioning;
  tlcirelease -> tlmima;
  tlcirelease -> tlsonatypecirelease;
  tlcirelease -> tlcisigning;
  tlcirelease -> tlnopub;

  tl[label="sbt-typelevel"];
  tl -> tlsettings;
  tl -> tlcirelease;
  tl -> fmt;
  tl -> header;
  tl -> sjscp;
  tl -> sncp;
}
